rtzaudio/STC1200_TivaTM4C1294NCPDT/RemoteTask.c
/***************************************************************************
 *
 * DTC-1200 & STC-1200 Digital Transport Controllers for
 * Ampex MM-1200 Tape Machines
 *
 * Copyright (C) 2016-2020, RTZ Professional Audio, LLC
 * All Rights Reserved
 *
 * RTZ is registered trademark of RTZ Professional Audio, LLC
 *
 ***************************************************************************
 *
 * Copyright (c) 2014, Texas Instruments Incorporated
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * *  Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 *
 * *  Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the distribution.
 *
 * *  Neither the name of Texas Instruments Incorporated nor the names of
 *    its contributors may be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO,
 * THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
 * PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR
 * CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,
 * EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,
 * PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS;
 * OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
 * WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR
 * OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
 * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 *
 ***************************************************************************/

/* XDCtools Header files */
#include <xdc/std.h>
#include <xdc/cfg/global.h>
#include <xdc/runtime/System.h>
#include <xdc/runtime/Error.h>
#include <xdc/runtime/Gate.h>

/* BIOS Header files */
#include <ti/sysbios/BIOS.h>
#include <ti/sysbios/knl/Semaphore.h>
#include <ti/sysbios/knl/Event.h>
#include <ti/sysbios/knl/Mailbox.h>
#include <ti/sysbios/knl/Task.h>
#include <ti/sysbios/knl/Clock.h>
#include <ti/sysbios/knl/Queue.h>
#include <ti/sysbios/gates/GateMutex.h>
#include <ti/sysbios/family/arm/m3/Hwi.h>

/* TI-RTOS Driver files */
#include <ti/drivers/GPIO.h>
#include <ti/drivers/SPI.h>
#include <ti/drivers/SDSPI.h>
#include <ti/drivers/UART.h>

#include <file.h>
#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <ctype.h>
#include <math.h>
#include <stdbool.h>

/* Graphiclib Header file */
#include <grlib/grlib.h>
#include "drivers/offscrmono.h"
/* PMX42 Board Header file */
#include "Board.h"
#include "AD9837.h"
#include "STC1200.h"
#include "IPCServer.h"
#include "RAMPServer.h"
#include "CLITask.h"
#include "RemoteTask.h"

/* External Global Data */
extern tContext g_context;
extern Mailbox_Handle g_mailboxRemote;

/* Static Function Prototypes */
static Void RemoteTaskFxn(UArg arg0, UArg arg1);
static void RemoteSetMode(uint32_t mode);
static void ResetDigitBuf(void);
static int StrToTapeTime(char *digits, TAPETIME* tapetime);
static bool IsDCSView(int32_t screen);
static void CompleteEditTimeState();
static void HandleButtonPress(uint32_t mask, uint32_t cue_flags);
static void HandleDigitPress(size_t index, uint32_t cue_flags);
static void HandleJogwheelClick(uint32_t switch_mask);
static void HandleJogwheelMotion(uint32_t velocity, int direction);
static void HandleViewChange(int32_t view, bool select);
static void SetMasterRefClock(float freq);

/*
 * Vari-Speed Master clock frequencies for tone step mode
 */

typedef struct _DDS_TONE_TAB {
    float   toneFreq;               /* ref freq in hertz */
    char    toneText[6];            /* tone label text   */
} DDS_TONE_TAB;

/* Since the frequency ratio of a semitone is close to 106%, increasing
 * or decreasing the playback speed of a recording by 6% will shift the
 * pitch up or down by about one semitone, or "half-step". Upscale
 * reel-to-reel magnetic tape recorders typically have pitch adjustments
 * of up to ±6%, generally used to match the playback or recording pitch
 * to other music sources having slightly different tunings (or possibly
 * recorded on equipment that was not running at quite the right speed).
 */

/* Extended tone range frequencies */
static const DDS_TONE_TAB toneTable[] =
{
    { 5086.0f,   { '5', ' ', '1', '/', '2', '\0' }},    /*  -5 1/2 (53.0%)  */
    { 5388.0f,   { '5', ' ', ' ', ' ', ' ', '\0' }},    /*  -5     (56.2%)  */
    { 5709.0f,   { '4', ' ', '1', '/', '2', '\0' }},    /*  -4 1/2 (59.5%)  */
    { 6048.0f,   { '4', ' ', ' ', ' ', ' ', '\0' }},    /*  -4     (63.0%)  */
    { 6407.0f,   { '3', ' ', '1', '/', '2', '\0' }},    /*  -3 1/2 (66.8%)  */
    { 6788.0f,   { '3', ' ', ' ', ' ', ' ', '\0' }},    /*  -3     (70.8%)  */
    { 7192.0f,   { '2', ' ', '1', '/', '2', '\0' }},    /*  -2 1/2 (75.0%)  */
    { 7619.0f,   { '2', ' ', ' ', ' ', ' ', '\0' }},    /*  -2     (79.4%)  */
    { 8073.0f,   { '1', ' ', '1', '/', '2', '\0' }},    /*  -1 1/2 (84.1%)  */
    /* start of standard Ampex varispeed tones */
    { 8553.0f,   { '1', ' ', ' ', ' ', ' ', '\0' }},    /*  -1     (89.1%)  */
    { 8803.0f,   { '3', '/', '4', ' ', ' ', '\0' }},    /* -3/4    (91.7%)  */
    { 9061.0f,   { '1', '/', '2', ' ', ' ', '\0' }},    /* -1/2    (94.3%)  */
    { 9327.0f,   { '1', '/', '4', ' ', ' ', '\0' }},    /* -1/4    (97.1%)  */
    { 9600.0f,   { 'R', 'E', 'F', ' ', '0', '\0' }},    /*   0     (100%)   */
    { 9681.0f,   { '1', '/', '4', ' ', ' ', '\0' }},    /* +1/4    (102.9%) */
    { 10171.0f,  { '1', '/', '2', ' ', ' ', '\0' }},    /* +1/2    (105.9%) */
    { 10469.0f,  { '3', '/', '4', ' ', ' ', '\0' }},    /* +3/4    (109.1%) */
    { 10776.0f,  { '1', ' ', ' ', ' ', ' ', '\0' }},    /*  +1     (112.2%) */
    /* end of standard Ampex varispeed tones */
    { 11416.0f,  { '1', ' ', '1', '/', '2', '\0' }},    /*  +1 1/2 (118.9%) */
    { 12095.0f,  { '2', ' ', ' ', ' ', ' ', '\0' }},    /*  +2     (125.9%) */
    { 12814.0f,  { '2', ' ', '1', '/', '2', '\0' }},    /*  +2 1/2 (133.4%) */
    { 13576.0f,  { '3', ' ', ' ', ' ', ' ', '\0' }},    /*  +3     (141.4%) */
    { 14383.0f,  { '3', ' ', '1', '/', '2', '\0' }},    /*  +3 1/2 (149.8%) */
    { 15238.0f,  { '4', ' ', ' ', ' ', ' ', '\0' }},    /*  +4     (158.7%) */
    { 16145.0f,  { '4', ' ', '1', '/', '2', '\0' }},    /*  +4 1/2 (168.1%) */
    { 17105.0f,  { '5', ' ', ' ', ' ', ' ', '\0' }},    /*  +5     (178.1%) */
};

