rtzaudio/STC1200_TivaTM4C1294NCPDT/RemoteTask.c
#define TONE_TAB_MAX        (sizeof(toneTable)/sizeof(DDS_TONE_TAB))
#define TONE_TAB_ZERO       13

//*****************************************************************************
// Return tone table entry as null terminated text string for display.
//*****************************************************************************

void GetToneText(char* buf)
{
    if (g_sys.toneIndex < TONE_TAB_ZERO) {
        *buf++ = '-';
    } else if (g_sys.toneIndex > TONE_TAB_ZERO) {
        *buf++ = '+';
    }

    strncpy(buf, toneTable[g_sys.toneIndex].toneText, 5);
    buf[5] = '\0';
}

//*****************************************************************************
// Set the master reference clock frequency. The default is clock is 9600 Hz.
//*****************************************************************************

void SetMasterRefClock(float freq)
{
    /* Calculate the 32-bit frequency divisor */
    uint32_t freqCalc = AD9837_freqCalc(freq);

    /* Program the DSS ref clock with new value */
    AD9837_adjustFreqMode32(FREQ0, FULL, freqCalc);
    AD9837_adjustFreqMode32(FREQ1, FULL, freqCalc);

    g_sys.ref_freq = freq;
}

//*****************************************************************************
// Initialize the remote display task
//*****************************************************************************

Bool Remote_Task_startup(void)
{
    Error_Block eb;
    Task_Params taskParams;

    g_sys.varispeedMode  = VARI_SPEED_OFF;
    g_sys.toneIndex      = TONE_TAB_ZERO;

    Error_init(&eb);

    Task_Params_init(&taskParams);

    taskParams.stackSize = 2048;
    taskParams.priority  = 10;
    taskParams.arg0      = 0;
    taskParams.arg1      = 0;

    Task_create((Task_FuncPtr)RemoteTaskFxn, &taskParams, &eb);

    return TRUE;
}

void Remote_PostSwitchPress(uint32_t mode, uint32_t flags)
{
    RAMP_MSG msg;

    msg.type     = MSG_TYPE_SWITCH;
    msg.opcode   = OP_SWITCH_REMOTE;
    msg.param1.U = mode;
    msg.param2.U = flags;

    Mailbox_post(g_mailboxRemote, &msg, 100);
}

//*****************************************************************************
// This converts the DRC GPIO transport control switch mask to DTC equivalent
// switch mask form for the transport controls. The transport button pin
// order on the remote is different from the DTC transport pin assignments.
//*****************************************************************************

uint32_t xlate_to_dtc_transport_switch_mask(uint32_t mask)
{
    uint32_t bits = 0;

    if (mask & SW_REC)      /* DRC REC button */
        bits |= S_REC;
    if (mask & SW_PLAY)     /* DRC PLAY button */
        bits |= S_PLAY;
    if (mask & SW_REW)      /* DRC REW button */
        bits |= S_REW;
    if (mask & SW_FWD)      /* DRC FWD button */
        bits |= S_FWD;
    if (mask & SW_STOP)     /* DRC STOP button */
        bits |= S_STOP;

    return bits;
}

void ResetDigitBuf(void)
{
    g_sys.digitCount = 0;

    memset(&g_sys.digitBuf, 0, sizeof(g_sys.digitBuf));
}

/*****************************************************************************
 * This function set the appropriate LOC button LED bit flag on and clears
 * all other LOC button LED bits so only one LOC LED is on at a time.
 *****************************************************************************/

void SetLocateButtonLED(size_t index)
{
    uint32_t mask = 0;

    static uint32_t tab[10] = {
        L_LOC0, L_LOC1, L_LOC2, L_LOC3, L_LOC4,
        L_LOC5, L_LOC6, L_LOC7, L_LOC8, L_LOC9
    };

    mask = tab[index % 10];

    if (g_sys.remoteMode == REMOTE_MODE_CUE)
        mask |= L_CUE;
    else if (g_sys.remoteMode == REMOTE_MODE_STORE)
        mask |= L_STORE;
    else
        mask = 0;

    SetButtonLedMask(mask, L_LOC_MASK);
}

/*****************************************************************************
 * This function sets or clears button LED bits on the remote.
 *****************************************************************************/

void SetButtonLedMask(uint32_t setMask, uint32_t clearMask)
{
    /* Atomic change bits */
    uint32_t key = Hwi_disable();

    /* Clear any bits in the clear mask */
    g_sys.ledMaskRemote &= ~(clearMask);

    /* Set any bits in the set mask */
    g_sys.ledMaskRemote |= setMask;

    /* Restore interrupts */
    Hwi_restore(key);
}

//*****************************************************************************
// DRC-1200 Wired Remote Controller Task
//
// This task handles all communications to the DRC-1200 wired remote via
// via the RS-422 port on the STC-1200 card. All of the OLED display drawing
// functions draw into an in-memory display buffer that gets sent to the
// OLED display in the DRC-1200 remote. The DRC-1200 is basically a dumb
// terminal display device.
//
//*****************************************************************************

Void RemoteTaskFxn(UArg arg0, UArg arg1)
{
    IPC_MSG ipc;
    RAMP_MSG msg;
    uint32_t cue_flags;

    g_sys.remoteMode = REMOTE_MODE_UNDEFINED;
    g_sys.cueIndex = 0;
    g_sys.remoteFieldIndex = FIELD_TRACK_NUM;
    g_sys.remoteView = VIEW_TAPE_TIME;
    g_sys.remoteViewSelect = false;
    g_sys.remoteTrackNum = 0;
    g_sys.remoteTrackNumSelect = false;

    /* Initialize LOC-1 memory as return to zero at CUE point 1 */
    g_sys.remoteModePrev = REMOTE_MODE_CUE;
    RemoteSetMode(REMOTE_MODE_CUE);
    HandleDigitPress(0, 0);

    ResetDigitBuf();

    if (!RAMP_Server_init()) {
        System_abort("RAMP server init failed");
    }

    while (TRUE)
    {
        /* Wait for a message up to 1 second */
        if (!Mailbox_pend(g_mailboxRemote, &msg, 50))
        {
            /* DIP switch #2 must be on to enable tx data to remote */
            if (GPIO_read(Board_DIPSW_CFG2) == 0)
                DrawScreen(g_sys.remoteView);
            continue;
        }

        switch(msg.type)
        {
        case MSG_TYPE_DISPLAY:
            /* Refresh the OLED display with contents of display.
             * buffer.
             */
            //if (msg.opcode == OP_DISPLAY_REFRESH)
            //    DrawScreen(s_uScreenNum);
            break;

        case MSG_TYPE_SWITCH:
            /* A transport button (stop, play, etc)  or locator button
             * was pressed on the DRC remote unit. Convert the DRC transport
             * button bit mask to DTC format and send the button press event
             * to the DTC to execute the new transport mode requested.
             */
            if (msg.opcode == OP_SWITCH_TRANSPORT)
            {
                /* Convert DRC switch bits to DTC bit mask form */
                uint32_t mask = xlate_to_dtc_transport_switch_mask(msg.param1.U);

