rtzaudio/STC1200_TivaTM4C1294NCPDT/RemoteTask.c
                /* Cancel any locate/loop in progress */
                if (IsLocating())
                    LocateCancel();

                /* Send the transport command button mask to the DTC */
                ipc.type     = IPC_TYPE_NOTIFY;
                ipc.opcode   = OP_NOTIFY_BUTTON;
                ipc.param1.U = mask;
                ipc.param2.U = 0;

                IPC_Notify(&ipc, 0);
            }
            else if (msg.opcode == OP_SWITCH_REMOTE)
            {
                /* A locate or other mode button was pressed */

                cue_flags = 0;

                if (g_sys.autoMode)
                    cue_flags |= CF_AUTO_PLAY;

                if (msg.param2.U & SW_REC)
                    cue_flags |= CF_AUTO_REC;

                HandleButtonPress(msg.param1.U, cue_flags);

                /* Signal the TCP worker thread switch press event */
                Event_post(g_eventTransport, Event_Id_02);
            }
            else if (msg.opcode == OP_SWITCH_JOGWHEEL)
            {
                /* Jog wheel switch button was pressed */
                HandleJogwheelClick(msg.param1.U);
            }
            break;

        case MSG_TYPE_JOGWHEEL:
            if (msg.opcode == OP_JOGWHEEL_MOTION)
            {
                /* Jog wheel was turned */
                HandleJogwheelMotion(msg.param1.U, msg.param2.I);
            }
            break;

        default:
            break;
        }
    }
}

//*****************************************************************************
// This function sets the current remote operation mode.
//*****************************************************************************

void RemoteSetMode(uint32_t mode)
{
    if (mode == REMOTE_MODE_UNDEFINED)
    {
        /*
         * No mode active, reset everything
         */

        ResetDigitBuf();

        /* No mode active */
        SetButtonLedMask(0, L_CUE | L_STORE | L_EDIT);

        g_sys.remoteModePrev = g_sys.remoteMode;

        g_sys.remoteMode = REMOTE_MODE_UNDEFINED;
    }
    else if (g_sys.remoteMode == mode)
    {
        /*
         * Same mode requested, cancel the current mode
         */

        g_sys.editState = EDIT_BEGIN;

        ResetDigitBuf();

        /* Set mode to undefined */
        g_sys.remoteMode = REMOTE_MODE_UNDEFINED;

        /* Update the button LEDs */
        switch(mode)
        {
        case REMOTE_MODE_CUE:
            g_sys.remoteModeLast = REMOTE_MODE_UNDEFINED;
            SetButtonLedMask(0, L_CUE);
            break;

        case REMOTE_MODE_STORE:
            g_sys.remoteMode = g_sys.remoteModePrev;
            SetButtonLedMask(0, L_STORE);
            break;

        case REMOTE_MODE_EDIT:
            g_sys.remoteMode = g_sys.remoteModeLast;
            SetButtonLedMask(0, L_EDIT);
            break;
        }

        SetLocateButtonLED(g_sys.cueIndex);
    }
    else
    {
        /*
         * New mode requested, set LED's accordingly
         */

        g_sys.remoteModePrev = g_sys.remoteMode;

        /* Save the new mode */
        g_sys.remoteMode = mode;

        /* Setup new mode requested */
        switch(mode)
        {
        case REMOTE_MODE_CUE:
            g_sys.remoteModeLast = mode;
            SetButtonLedMask(L_CUE, L_CUE | L_STORE | L_EDIT);
            break;

        case REMOTE_MODE_STORE:
            g_sys.remoteModeLast = mode;
            SetButtonLedMask(L_STORE, L_CUE | L_STORE | L_EDIT);
            break;

        case REMOTE_MODE_EDIT:
            /* Reset digit input buffer */
            ResetDigitBuf();
            /* Reset the edit time structure */
            g_sys.editTime.hour  = 0;
            g_sys.editTime.mins  = 0;
            g_sys.editTime.secs  = 0;
            g_sys.editTime.frame = 0;
            g_sys.editTime.flags = F_PLUS;
            /* Begin at hour entry state */
            g_sys.editState = EDIT_BEGIN;
            /* Set new button LED state */
            SetButtonLedMask(L_EDIT, L_CUE | L_STORE | L_EDIT);
            break;

        default:
            SetButtonLedMask(0, L_CUE | L_STORE | L_EDIT);
            break;
        }

        SetLocateButtonLED(g_sys.cueIndex);
    }
}

//*****************************************************************************
// Finished the time edit mode and stores the current result in the
// cue point currently being edited.
//*****************************************************************************

void CompleteEditTimeState(void)
{
    int count;
    int ipos;

    /* Get count of digits entered */
    count = g_sys.digitCount;

    /* Reset the digit counter */
    ResetDigitBuf();

    /* Exit EDIT mode back to previous state */
    RemoteSetMode(REMOTE_MODE_EDIT);

    /* Only store value if digits were entered */
    if (count)
    {
        /* Convert H:MM:SS time to total seconds */
        TapeTimeToPosition(&g_sys.editTime, &ipos);

        /* Store the position at current memory index */
        CuePointSet(g_sys.cueIndex, ipos, CF_ACTIVE);
    }

    memset(&g_sys.editTime, 0, sizeof(g_sys.editTime));

    g_sys.editState = EDIT_BEGIN;
}

//*****************************************************************************
// Parses a alphanumeric string of digits and converts it to tape time.
//*****************************************************************************

int StrToTapeTime(char *digits, TAPETIME* tapetime)
{
    int  dcount;
    char buf[8];

    if (!digits)
        return 0;

    memset(buf, 0, sizeof(buf));

    dcount = strlen(digits);

    switch(dcount)
    {
    case 1:
        /* parse tens units */
        buf[0] = digits[0];
        buf[1] = 0;
        tapetime->tens = atoi(buf);
        break;

    case 2:
        /* parse tens units */
        buf[0] = digits[0];
        buf[1] = 0;
        tapetime->tens = atoi(buf);
        /* parse secs units */
        buf[0] = digits[1];
        buf[1] = 0;
        tapetime->secs = atoi(buf);
        break;

    case 3:
        /* parse tens units */
        buf[0] = digits[0];
        buf[1] = 0;
        tapetime->tens = atoi(buf);
        /* parse secs units */
        buf[0] = digits[1];
        buf[1] = digits[2];
        buf[2] = 0;
        tapetime->secs = atoi(buf);
        break;

    case 4:
        /* parse tens units */
        buf[0] = digits[0];
        buf[1] = 0;
        tapetime->tens = atoi(buf);
        /* parse secs units */
        buf[0] = digits[1];
        buf[1] = digits[2];
        buf[2] = 0;
        tapetime->secs = atoi(buf);
        /* parse mins units */
        buf[0] = digits[3];
        buf[1] = 0;
        tapetime->mins = atoi(buf);
        break;

    case 5:
        /* parse tens units */
        buf[0] = digits[0];
        buf[1] = 0;
        tapetime->tens = atoi(buf);
        /* parse secs units */
        buf[0] = digits[1];
        buf[1] = digits[2];
        buf[2] = 0;
        tapetime->secs = atoi(buf);
        /* parse mins units */
        buf[0] = digits[3];
        buf[1] = digits[4];
        buf[2] = 0;
        tapetime->mins = atoi(buf);
        break;

