rtzaudio/STC1200_TivaTM4C1294NCPDT/RemoteTask.c
    case 6:
        /* parse tens units */
        buf[0] = digits[0];
        buf[1] = 0;
        tapetime->tens = atoi(buf);
        /* parse secs units */
        buf[0] = digits[1];
        buf[1] = digits[2];
        buf[2] = 0;
        tapetime->secs = atoi(buf);
        /* parse mins units */
        buf[0] = digits[3];
        buf[1] = digits[4];
        buf[2] = 0;
        tapetime->mins = atoi(buf);
        /* parse hour unit */
        buf[0] = digits[5];
        buf[1] = 0;
        tapetime->hour = atoi(buf);
        break;

    default:
        /* length error */
        dcount = 0;
        break;
    }

    return dcount;
}

//*****************************************************************************
// Handle button press events from DRC remote
//*****************************************************************************

void HandleButtonPress(uint32_t mask, uint32_t cue_flags)
{
    /* Ignore all other buttons, except MENU if, in view select mode */
    if (g_sys.remoteViewSelect && ((mask & SW_MENU) == 0))
            return;

    /* Handle numeric digit/locate buttons */
    if (mask & SW_LOC0) {
        HandleDigitPress(0, cue_flags);
    } else if (mask & SW_LOC1) {
        HandleDigitPress(1, cue_flags);
    } else if (mask & SW_LOC2) {
        HandleDigitPress(2, cue_flags);
    } else if (mask & SW_LOC3) {
        HandleDigitPress(3, cue_flags);
    } else if (mask & SW_LOC4) {
        HandleDigitPress(4, cue_flags);
    } else if (mask & SW_LOC5) {
        HandleDigitPress(5, cue_flags);
    } else if (mask & SW_LOC6) {
        HandleDigitPress(6, cue_flags);
    } else if (mask & SW_LOC7) {
        HandleDigitPress(7, cue_flags);
    } else if (mask & SW_LOC8) {
        HandleDigitPress(8, cue_flags);
    } else if (mask & SW_LOC9) {
        HandleDigitPress(9, cue_flags);
    } else if (mask & SW_CUE) {
        /* Switch to CUE mode */
        RemoteSetMode(REMOTE_MODE_CUE);
    }
    else if (mask & SW_STORE)
    {
        /* Switch to STORE mode */
        RemoteSetMode(REMOTE_MODE_STORE);
    }
    else if (mask & SW_EDIT)
    {
        /* Switch to EDIT mode */
        if (g_sys.remoteView == VIEW_TAPE_TIME)
        {
            RemoteSetMode(REMOTE_MODE_EDIT);
        }
    }
    else if (mask & SW_MENU)
    {
        /* ALT+MENU to zero reset system position */
        if (mask & SW_ALT)
        {
            if (g_sys.remoteView == VIEW_TAPE_TIME)
            {
                /* Reset system position to zero */
                PositionZeroReset();
            }
        }
        else
        {
            if (!g_sys.remoteViewSelect)
            {
                g_sys.remoteViewSelect = true;
                /* turn on menu button led */
                SetButtonLedMask(L_MENU, 0);
            }
            else
            {
                g_sys.remoteViewSelect = false;
                /* turn off menu button led */
                SetButtonLedMask(0, L_MENU);
            }
            /* call the view change handler */
            HandleViewChange(g_sys.remoteView, g_sys.remoteViewSelect);
        }
    }
    else if (mask & SW_AUTO)
    {
        /* toggle auto play mode */
        if (!g_sys.autoMode)
        {
            g_sys.autoMode = TRUE;
            SetButtonLedMask(L_AUTO, 0);
        }
        else
        {
            g_sys.autoMode = FALSE;
            SetButtonLedMask(0, L_AUTO);
        }
    }

    // Notify the software remote of status change
    Event_post(g_eventTransport, Event_Id_02);
}

//*****************************************************************************
// This handler is called for any digit keys (0-9) pressed on the remote.
//*****************************************************************************

void HandleDigitPress(size_t index, uint32_t cue_flags)
{
    int len;
    char digit;
    static char digits[] = { '0', '1', '2', '3', '4', '5', '6', '7', '8', '9' };

    if (g_sys.remoteMode == REMOTE_MODE_CUE)
    {
        /*
         * Remote is in CUE mode and a LOC-# button was pressed
         */

        g_sys.cueIndex = index;

        SetLocateButtonLED(index);

        /* Begin locate search */
        LocateSearch(index, cue_flags);
    }
    else if (g_sys.remoteMode == REMOTE_MODE_STORE)
    {
        /*
         * Remote is in STORE mode and a LOC-# button was pressed
         */
        g_sys.cueIndex = index;

        SetLocateButtonLED(index);

        /* Store the current locate point */
        CuePointSet(index, g_sys.tapePosition, CF_ACTIVE);

        /* Return to previous Cue or default mode */
        RemoteSetMode(g_sys.remoteModePrev);

        SetLocateButtonLED(g_sys.cueIndex);
    }
    else if (g_sys.remoteMode == REMOTE_MODE_EDIT)
    {
        /*
         * Remote is in EDIT mode and a digit 0-9 was pressed.
         */

        if (g_sys.editState == EDIT_BEGIN)
        {
            g_sys.editTime.frame = 0;
            g_sys.editTime.tens  = 0;
            g_sys.editTime.secs  = 0;
            g_sys.editTime.mins  = 0;
            g_sys.editTime.hour  = 0;
            g_sys.editTime.flags = F_PLUS;

            g_sys.editState = EDIT_DIGITS;

            memset(&g_sys.editTime, 0, sizeof(g_sys.editTime));

            ResetDigitBuf();
        }

        digit = digits[index];

        if (g_sys.digitCount >= MAX_DIGITS_BUF)
            g_sys.digitCount = 0;

        g_sys.digitBuf[g_sys.digitCount++] = digit;
        g_sys.digitBuf[g_sys.digitCount] = 0;

        len = StrToTapeTime(g_sys.digitBuf, &g_sys.editTime);

        if (len >= 6)
        {
            CompleteEditTimeState();
        }
    }
    else
    {
        g_sys.cueIndex = index;

        SetLocateButtonLED(index);
    }
}

//*****************************************************************************
// Helper Functions
//*****************************************************************************

void AdvanceFieldIndex(int direction, int min, int max)
{
    if (direction > 0)
    {
        ++g_sys.remoteFieldIndex;

        if (g_sys.remoteFieldIndex > max)
            g_sys.remoteFieldIndex = min;

