rtzaudio/STC1200_TivaTM4C1294NCPDT/RemoteTask.c
    }
    else
    {
        if (g_sys.remoteFieldIndex == 0)
            g_sys.remoteFieldIndex = max;
        else
            --g_sys.remoteFieldIndex;
    }
}

//*****************************************************************************
// This handler is called whenever entering or exiting a view. This can
// be used to set the default field index to something other than zero.
//*****************************************************************************

void HandleViewChange(int32_t view, bool select)
{
    switch(view)
    {
    case VIEW_SET_TAPE_SPEED:
        if (select)
            g_sys.remoteFieldIndex = (g_sys.tapeSpeed == 30) ? 1 : 0;
        break;

    case VIEW_SET_MASTER_MON:
        if (select)
            g_sys.remoteFieldIndex = (g_sys.standbyMonitor) ? 1 : 0;
        break;

    case VIEW_SET_LONGTIME:
        if (select)
            g_sys.remoteFieldIndex = (g_sys.cfgSTC.showLongTime) ? 1 : 0;
        break;

    case VIEW_SET_BLINK7SEG:
        if (select)
            g_sys.remoteFieldIndex = (g_sys.cfgSTC.searchBlink) ? 1 : 0;
        break;

    default:
        break;
    }
}

//*****************************************************************************
// Returns true if the view screen number is a DCS function, false otherwise.
//*****************************************************************************

bool IsDCSView(int32_t screen)
{
    bool flag = false;

    switch(screen)
    {
    case VIEW_TRACK_ASSIGN:
    case VIEW_TRACK_SET_ALL:
    case VIEW_SET_STANDBY_ALL:
    case VIEW_SET_MASTER_MON:
    case VIEW_SET_TAPE_SPEED:
        flag = true;
        break;

    default:
        flag = false;
        break;
    }

    return flag;
}

//*****************************************************************************
// This handler is called when the remote jog wheel is being turned by the
// user. Direction and velocity of the jog wheel are passed to the handler.
//*****************************************************************************

void HandleJogwheelMotion(uint32_t velocity, int direction)
{
    float freq = 9600.0f;
    float step;

    if (g_sys.remoteViewSelect)
    {
        /* Reset field being edited since the screen changed */
        g_sys.remoteFieldIndex = 0;
        g_sys.remoteTrackNumSelect = false;

        if (direction > 0)
        {
            /* next screen view */
            ++g_sys.remoteView;

            if (g_sys.remoteView >= VIEW_LAST)
                g_sys.remoteView = VIEW_TAPE_TIME;

            if (!g_sys.dcsFound && IsDCSView(g_sys.remoteView))
                g_sys.remoteView = VIEW_INFO;
        }
        else
        {
            /* previous screen view */
            if (g_sys.remoteView <= 0)
                g_sys.remoteView = VIEW_LAST - 1;
            else
                g_sys.remoteView--;

            if (!g_sys.dcsFound && IsDCSView(g_sys.remoteView))
                g_sys.remoteView = VIEW_TAPE_TIME;
        }

        /* notify view change */
        HandleViewChange(g_sys.remoteView, 1);
    }
    else if (g_sys.varispeedMode)
    {
        if (g_sys.varispeedMode == VARI_SPEED_TONE)
        {
            if (direction > 0)
            {
                ++g_sys.toneIndex;

                if (g_sys.toneIndex >= TONE_TAB_MAX)
                    g_sys.toneIndex = TONE_TAB_MAX - 1;
            }
            else
            {
                if (g_sys.toneIndex > 0)
                    --g_sys.toneIndex;
            }

            freq = toneTable[g_sys.toneIndex].toneFreq;

            /* Set the new ref clock speed */
            SetMasterRefClock(freq);
        }
        else if (g_sys.varispeedMode == VARI_SPEED_STEP)
        {
            if (velocity >= 12)
                step = 1000.0f;
            else if (velocity >= 8)
                step = 500.0f;
            else if (velocity >= 5)
                step = 100.0f;
            else if (velocity >= 3)
                step = 10.0f;
            else
                step = 1.0f;

            freq = g_sys.ref_freq;

            if (direction > 0)
            {
                if ((freq + step) < REF_FREQ_MAX)
                    freq += step;
                else
                    freq = REF_FREQ_MAX;
            }
            else
            {
                if (step > freq)
                    freq = REF_FREQ_MIN;
                else if ((freq - step) > REF_FREQ_MIN)
                    freq -= step;
                else
                    freq = REF_FREQ_MIN;
            }

            /* Set the new ref clock speed */
            SetMasterRefClock(freq);
        }
    }
    else if (g_sys.remoteView == VIEW_TRACK_ASSIGN)
    {
        if (g_sys.remoteTrackNumSelect)
        {
            if (direction > 0)
            {
                ++g_sys.remoteTrackNum;

                if (g_sys.remoteTrackNum >= g_sys.trackCount)
                    g_sys.remoteTrackNum = 0;
            }
            else
            {
                if (g_sys.remoteTrackNum == 0)
                    g_sys.remoteTrackNum =  g_sys.trackCount - 1;
                else
                    --g_sys.remoteTrackNum;
            }
        }
        else
        {
            AdvanceFieldIndex(-direction, 0, FIELD_LAST-1);
        }
    }
    else if (g_sys.remoteView == VIEW_TRACK_SET_ALL)
    {
        AdvanceFieldIndex(direction, 0, 4);
    }
    else if (g_sys.remoteView == VIEW_SET_STANDBY_ALL)
    {
        AdvanceFieldIndex(direction, 0, 1);
    }
    else if (g_sys.remoteView == VIEW_SET_MASTER_MON)
    {
        AdvanceFieldIndex(direction, 0, 1);
    }
    else if (g_sys.remoteView == VIEW_SET_TAPE_SPEED)
    {
        AdvanceFieldIndex(direction, 0, 1);
    }
    else if (g_sys.remoteView == VIEW_SET_LONGTIME)
    {
        AdvanceFieldIndex(direction, 0, 1);
    }
    else if (g_sys.remoteView == VIEW_SET_BLINK7SEG)
    {
        AdvanceFieldIndex(direction, 0, 1);
    }
}

//*****************************************************************************
// This handler is called when the user presses the jog wheel down to close
// the switch within jog wheel encoder.
//*****************************************************************************

void HandleJogwheelClick(uint32_t switch_mask)
{
    float freq;
    uint8_t mode;
    uint8_t trackState;
    int32_t trackNum;
    bool back2viewselect = false;

    if (g_sys.remoteViewSelect)
    {
        /* exit view select mode */
        g_sys.remoteViewSelect = false;

