rtzaudio/STC1200_TivaTM4C1294NCPDT/RemoteTask.c
        /* turn off menu button led */
        SetButtonLedMask(0, L_MENU);

        /* notify view change */
        HandleViewChange(g_sys.remoteView, false);
        return;
    }

    if (g_sys.remoteView == VIEW_TAPE_TIME)
    {
        switch (g_sys.remoteMode)
        {
        case REMOTE_MODE_EDIT:
            CompleteEditTimeState();
            break;

        default:
            if (g_sys.varispeedMode == VARI_SPEED_OFF)
            {
                /* Enable vari-speed mode */
                if ((switch_mask & SW_ALT) == 0)
                {
                    /* Enable tone increment mode */
                    g_sys.toneIndex = TONE_TAB_ZERO;
                    g_sys.varispeedMode = VARI_SPEED_TONE;

                    freq = toneTable[g_sys.toneIndex].toneFreq;
                }
                else
                {
                    /* Enable frequency step mode */
                    g_sys.varispeedMode = VARI_SPEED_STEP;

                    freq = REF_FREQ;
                }

                /* Set the new ref clock speed */
                SetMasterRefClock(freq);
            }
            else
            {
                /* Vari-Speed Mode is Active! */
                if (g_sys.varispeedMode == VARI_SPEED_TONE)
                {
                    if (!(switch_mask & SW_ALT))
                    {
                        /* Exit tone increment mode to frequency step mode.
                         * The next click will exit vari-speed mode.
                         */
                        g_sys.varispeedMode = VARI_SPEED_STEP;
                        break;
                    }
                }

                /* Disable vari-speed mode */
                g_sys.toneIndex = TONE_TAB_ZERO;
                g_sys.varispeedMode = VARI_SPEED_OFF;

                /* Exit vari-speed mode, set ref to default */
                SetMasterRefClock(REF_FREQ);
            }
            break;
        }
    }
    else if (g_sys.remoteView == VIEW_TRACK_ASSIGN)
    {
        /* Check for ALT/Shift button modifier */
        if ((switch_mask & SW_ALT) && (g_sys.remoteFieldIndex == FIELD_TRACK_MONITOR))
        {
            if (g_sys.standbyMonitor)
            {
                /* disable global standby monitor */
                g_sys.standbyMonitor = false;
                Track_StandbyTransferAll(false);
            }
            else
            {
                /* enable global standby monitor */
                g_sys.standbyMonitor = true;
                Track_StandbyTransferAll(true);
            }
        }
        else
        {
            trackNum = g_sys.remoteTrackNum;

            switch(g_sys.remoteFieldIndex)
            {
            case FIELD_TRACK_NUM:
                if (!g_sys.remoteTrackNumSelect)
                    g_sys.remoteTrackNumSelect = true;
                else
                    g_sys.remoteTrackNumSelect = false;
                break;

            case FIELD_TRACK_ARM:
                /* Toggle track ready(armed) state */
                Track_GetState(trackNum, &trackState);

                /* toggle the ready flag */
                if (trackState & STC_T_READY)
                    trackState &= ~STC_T_READY;
                else
                    trackState |= STC_T_READY;

                /* update the new track state */
                Track_SetState(trackNum, trackState);
                break;

            case FIELD_TRACK_MODE:
                /* Get current track mode */
                Track_GetState(trackNum, &trackState);

                mode = STC_TRACK_MASK & trackState;

                ++mode;

                if (mode > STC_TRACK_INPUT)
                    mode = STC_TRACK_REPRO;

                trackState &= ~(STC_TRACK_MASK);

                trackState |= mode;

                /* update the new track state */
                Track_SetState(trackNum, trackState);

                break;

            case FIELD_TRACK_MONITOR:
                /* Get the current standby monitor state */
                Track_GetState(trackNum, &trackState);

                /* Toggle monitor enable flag for the track */
                trackState ^= STC_T_MONITOR;

                /* If not in monitor mode, clear standby bit! */
                if (!(trackState & STC_T_MONITOR))
                {
                    trackState &= ~(STC_T_STANDBY);
                }
                else
                {
                    /* If master monitor enabled, enable standby mode for
                     * the track so it will switch to standby input mode.
                     */
                    if (g_sys.standbyMonitor)
                        trackState |= STC_T_STANDBY;
                }

                /* update the new track state */
                Track_SetState(trackNum, trackState);
                break;

            default:
                g_sys.remoteFieldIndex = 0;
                break;
            }
        }
    }
    else if (g_sys.remoteView == VIEW_TRACK_SET_ALL)
    {
        switch (g_sys.remoteFieldIndex)
        {
        case 0:
            /* Set all tracks to input */
            Track_SetModeAll(STC_TRACK_INPUT);
            break;
        case 1:
            /* Set all tracks to sync */
            Track_SetModeAll(STC_TRACK_SYNC);
            break;
        case 2:
            /* Set all tracks to repro */
            Track_SetModeAll(STC_TRACK_REPRO);
            break;
        case 3:
            /* Set all tracks to safe */
            Track_MaskAll(0, STC_T_READY);
            break;
        case 4:
            /* Set all tracks to ready */
            Track_MaskAll(STC_T_READY, 0);
            break;
        }

        back2viewselect = true;
    }
    else if (g_sys.remoteView == VIEW_SET_MASTER_MON)
    {
        if (g_sys.remoteFieldIndex == 0)
        {
            /* disable global standby monitor */
            if (g_sys.standbyMonitor)
            {
                g_sys.standbyMonitor = false;
                Track_StandbyTransferAll(false);
            }
        }
        else
        {
            /* enable global standby monitor */
            if (!g_sys.standbyMonitor)
            {
                g_sys.standbyMonitor = true;
                Track_StandbyTransferAll(true);
            }
        }

        back2viewselect = true;
    }
    else if (g_sys.remoteView == VIEW_SET_STANDBY_ALL)
    {
        if (g_sys.remoteFieldIndex == 0)
            Track_MaskAll(0, STC_T_MONITOR);
        else
            Track_MaskAll(STC_T_MONITOR, 0);

        back2viewselect = true;
    }
    else if (g_sys.remoteView == VIEW_SET_TAPE_SPEED)
    {
        if (g_sys.remoteFieldIndex == 0)
            Track_SetTapeSpeed(15);
        else
            Track_SetTapeSpeed(30);

        back2viewselect = true;
    }
    else if (g_sys.remoteView == VIEW_SET_LONGTIME)
    {
        g_sys.cfgSTC.showLongTime = (g_sys.remoteFieldIndex == 0) ? false : true;

        back2viewselect = true;
    }
    else if (g_sys.remoteView == VIEW_SET_BLINK7SEG)
    {
        g_sys.cfgSTC.searchBlink = (g_sys.remoteFieldIndex == 0) ? false : true;

        back2viewselect = true;
    }

    /* Return back to view navigation mode if view select flat is set */

    if (back2viewselect)
    {
        /* turn on menu button led */
        SetButtonLedMask(L_MENU, 0);
        /* return to view select mode */
        g_sys.remoteViewSelect = true;
    }
}

// End-Of-File
